Revit 2027 API
View3D.ResetCameraTarget Method
 Resets the camera target to the center of the field of view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetCameraTarget()
Public Sub ResetCameraTarget
public:
void ResetCameraTarget()
member ResetCameraTarget : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The camera target cannot be reset for the view.
Remarks
 The camera target can only be reset for perspective view.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace